<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Jamf Connect and repackages it without the login window component. Designed </string>
    <key>Identifier</key>
    <string>com.github.Woodmember.pkg.Jamf Connect - No Login Window</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Jamf Connect</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.yohan460-recipes.download.JamfConnect</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/JamfConnect.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: JAMF Software (483DWKW443)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>flat_pkg_path</key>
                <string>%pathname%/JamfConnect.pkg</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/JamfConnectMenubar.pkg/Payload</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/Applications/Jamf Connect.app/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                    <key>LSMinimumSystemVersion</key>
                    <string>min_os_version</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
 <dict>
     <key>Processor</key>
     <string>PkgRootCreator</string>
     <key>Arguments</key>
     <dict>
         <key>pkgdirs</key>
         <dict/>
         <key>pkgroot</key>
         <string>%RECIPE_CACHE_DIR%/pkgroot</string>
     </dict>
 </dict>
 
 <dict>
     <key>Processor</key>
     <string>PkgRootCreator</string>
     <key>Arguments</key>
     <dict>
         <key>pkgdirs</key>
         <dict/>
         <key>pkgroot</key>
         <string>%RECIPE_CACHE_DIR%/scripts</string>
     </dict>
 </dict>
<dict>
	<key>Processor</key>
	<string>Copier</string>
	<key>Arguments</key>
	<dict>
		<key>source_path</key>
		<string>%RECIPE_CACHE_DIR%/unpack/JCDaemon.pkg</string>
		<key>destination_path</key>
		<string>%RECIPE_CACHE_DIR%/scripts/JCDaemon.pkg</string>
	</dict>
</dict>
<dict>
	<key>Processor</key>
	<string>Copier</string>
	<key>Arguments</key>
	<dict>
		<key>source_path</key>
		<string>%RECIPE_CACHE_DIR%/unpack/JamfConnectMenubar.pkg</string>
		<key>destination_path</key>
		<string>%RECIPE_CACHE_DIR%/scripts/JamfConnectMenubar.pkg</string>
	</dict>
</dict>
 <dict>
     <key>Arguments</key>
     <dict>
         <key>source_flatpkg_dir</key>
         <string>%RECIPE_CACHE_DIR%/unpack/</string>
         <key>destination_pkg</key>
         <string>%RECIPE_CACHE_DIR%/%NAME%-%version%-NoLoginWindow.pkg</string>
     </dict>
     <key>Processor</key>
     <string>FlatPkgPacker</string>
 </dict>
 <dict>
 	<key>Processor</key>
 	<string>Copier</string>
 	<key>Arguments</key>
 	<dict>
 		<key>source_path</key>
 		<string>%RECIPE_CACHE_DIR%/payload/Applications/</string>
 		<key>destination_path</key>
 		<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/</string>
 	</dict>
 </dict>
 <dict>
 	<key>Processor</key>
 	<string>Copier</string>
 	<key>Arguments</key>
 	<dict>
 		<key>source_path</key>
 		<string>%RECIPE_CACHE_DIR%/payload/Library/</string>
 		<key>destination_path</key>
 		<string>%RECIPE_CACHE_DIR%/pkgroot/Library/</string>
 	</dict>
 </dict> 
 <dict>
     <key>Processor</key>
     <string>FileCreator</string>
     <key>Arguments</key>
     <dict>
         <key>file_content</key>
         <string>#!/bin/bash
# Set working directory
pkgDir=$( /usr/bin/dirname "${0}" )

# Install JCDaemon
echo "Installing JCDaemon..."
/usr/sbin/installer -dumplog -verbose -pkg "${pkgDir}/JCDaemon.pkg" -target /
exitCode=$?
/bin/sleep 2

# Install JamfConnectMenubar
echo "Installing JamfConnectMenubar..."
/usr/sbin/installer -dumplog -verbose -pkg "${pkgDir}/JamfConnectMenubar.pkg" -target /
exitCode=$?
/bin/sleep 2

exit 0</string>
<key>file_mode</key>
<string>0755</string>
<key>file_path</key>
<string>%RECIPE_CACHE_DIR%/scripts/postinstall</string>
    </dict>
</dict>
<dict>
	<key>Processor</key>
	<string>PkgCreator</string>
	<key>Arguments</key>
	<dict>
		<key>pkg_request</key>
		<dict>
			<key>id</key>
			<string>com.jamf.connect</string>
			<key>pkgname</key>
			<string>%NAME%-%version%-NoLoginWindow</string>
			<key>pkgroot</key>
			<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			<key>pkgtype</key>
			<string>flat</string>
			<key>scripts</key>
			<string>Scripts</string>
			<key>version</key>
			<string>%version%</string>
		</dict>
	</dict>
</dict>
       <dict>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
        </dict>
    </array>
</dict>
</plist>
