<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of the DisplayLink Manager App and packages it</string>
		<key>Identifier</key>
		<string>com.github.Woodmember-Autopkg-Recipes.pkg.DisplayLink_Manager</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>DisplayLink Manager</string>
			<key>SOFTWARE_TITLE</key>
			<string>DisplayLink_Manager</string>
			<key>BUNDLE_ID</key>
			<string>com.displaylink.displaylinkmanagerapp</string>
		</dict>
		<key>ParentRecipe</key>
		<string>com.github.smithjw.download.DisplayLink_Manager</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%</string>
					<key>pkgdirs</key>
					<dict>
						<key>pkgroot</key>
						<integer>775</integer>
						<key>Scripts</key>
						<integer>775</integer>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.mlbz521.SharedProcessors/XarExtractSingleFile</string>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%.pkg</string>
					<key>file_to_extract</key>
					<string>Distribution</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.mlbz521.SharedProcessors/XPathParser</string>
				<key>Arguments</key>
				<dict>
					<key>xml_file</key>
					<string>%extracted_file%</string>
					<key>xpath</key>
					<string>.//pkg-ref[@id="%BUNDLE_ID%"]/bundle-version/bundle[@path="%NAME%.app"]</string>
					<key>attribute_one</key>
					<string>CFBundleShortVersionString</string>
					<key>return_variable_attribute_one</key>
					<string>version</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.mlbz521.SharedProcessors/XPathParser</string>
				<key>Arguments</key>
				<dict>
					<key>xml_file</key>
					<string>%extracted_file%</string>
					<key>xpath</key>
					<string>.//os-version[@min]</string>
					<key>attribute_one</key>
					<string>min</string>
					<key>return_variable_attribute_one</key>
					<string>minimum_os_version</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCopier</string>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%.pkg</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%/Scripts/%SOFTWARE_TITLE%-%version%.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCopier</string>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%_Extension.dmg/%found_basename%</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%/Scripts/%SOFTWARE_TITLE%_Extension-%version%.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
					<key>file_path</key>
					<string>%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%/Scripts/preinstall</string>
					<key>file_mode</key>
					<integer>755</integer>
					<key>file_content</key>
					<string>#!/bin/bash

DISPLAYLINK_PKG="%SOFTWARE_TITLE%-%version%.pkg"
DISPLAYLINK_EXTENTION_PKG="%SOFTWARE_TITLE%_Extension-%version%.pkg"

/usr/sbin/installer -pkg "$DISPLAYLINK_PKG" -target "$3"
/usr/sbin/installer -pkg "$DISPLAYLINK_EXTENTION_PKG" -target "$3"

exit 0
</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>id</key>
						<string>%BUNDLE_ID%</string>
						<key>version</key>
						<string>%version%</string>
						<key>options</key>
						<string>purge_ds_store</string>
						<key>pkgname</key>
						<string>%SOFTWARE_TITLE%-%version%</string>
						<key>pkgdir</key>
						<string>%RECIPE_CACHE_DIR%</string>
						<key>scripts</key>
						<string>%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%/Scripts</string>
						<key>pkgroot</key>
						<string>%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%/pkgroot</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.smithjw.processors/FriendlyPathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>fail_deleter_silently</key>
					<true/>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%</string>
						<string>%RECIPE_CACHE_DIR%/extractedfile</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
