<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of the DisplayLink Manager App and packages it</string>
		<key>Identifier</key>
		<string>com.github.Woodmember-Autopkg-Recipes.pkg.DisplayLink_Manager</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>DisplayLink Manager</string>
			<key>SOFTWARE_TITLE</key>
			<string>DisplayLink_Manager</string>
			<key>BUNDLE_ID</key>
			<string>com.displaylink.displaylinkmanagerapp</string>
		</dict>
		<key>ParentRecipe</key>
		<string>com.github.Woodmember-Autopkg-Recipes.download.DisplayLink_Manager</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%</string>
					<key>pkgdirs</key>
					<dict>
						<key>pkgroot</key>
						<string>775</string>
						<key>Scripts</key>
						<string>775</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<key>flat_pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%.pkg</string>
				</dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/DisplayLinkManagerApp.pkg/Payload</string>
					<key>purge_destination</key>
					<true/>
				</dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
			</dict>
			<dict>
			<key>Processor</key>
			<string>PlistReader</string>
			<key>Arguments</key>
				<dict>
					<key>info_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/%NAME%.app/Contents/Info.plist</string>
					<key>plist_keys</key>
					<dict>
						<key>CFBundleShortVersionString</key>
						<string>version</string>
						<key>CFBundleVersion</key>
						<string>nameversion</string>
						<key>CFBundleIdentifier</key>
						<string>identifier</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCopier</string>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%.pkg</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%/Scripts/%SOFTWARE_TITLE%-%version%.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCopier</string>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%SOFTWARE_TITLE%_Extension.dmg/%found_basename%</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%/Scripts/%SOFTWARE_TITLE%_Extension-%version%.pkg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>FileCreator</string>
				<key>Arguments</key>
				<dict>
					<key>file_path</key>
					<string>%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%/Scripts/preinstall</string>
					<key>file_mode</key>
					<string>755</string>
					<key>file_content</key>
					<string>#!/bin/bash

DISPLAYLINK_PKG="%SOFTWARE_TITLE%-%version%.pkg"
DISPLAYLINK_EXTENTION_PKG="%SOFTWARE_TITLE%_Extension-%version%.pkg"

/usr/sbin/installer -pkg "$DISPLAYLINK_PKG" -target "$3"
/usr/sbin/installer -pkg "$DISPLAYLINK_EXTENTION_PKG" -target "$3"

exit 0
</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>id</key>
						<string>%BUNDLE_ID%</string>
						<key>version</key>
						<string>%version%</string>
						<key>options</key>
						<string>purge_ds_store</string>
						<key>pkgname</key>
						<string>%SOFTWARE_TITLE%-%version%</string>
						<key>pkgdir</key>
						<string>%RECIPE_CACHE_DIR%</string>
						<key>scripts</key>
						<string>%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%/Scripts</string>
						<key>pkgroot</key>
						<string>%RECIPE_CACHE_DIR%/%SOFTWARE_TITLE%/pkgroot</string>
					</dict>
				</dict>
			</dict>
	   	 <dict>
	   	     <key>Processor</key>
	   	     <string>PathDeleter</string>
	   	     <key>Arguments</key>
	   	     <dict>
	   	         <key>path_list</key>
	   	         <array>
	   	        	<string>%RECIPE_CACHE_DIR%/unpack/</string>
				<string>%RECIPE_CACHE_DIR%/payload/</string>
				<string>%RECIPE_CACHE_DIR%/DisplayLink_Manager/</string>
	   	         </array>
	   	     </dict>
	   	 </dict>
		</array>
	</dict>
</plist>
