<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Dell DDPM. Then extracts the installer pkg and checks cert.</string>
	<key>Identifier</key>
	<string>com.github.Woodmember-Autopkg-Recipes.download.DellDisplayPeripheralManager(DDPM)</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Dell Display and Peripheral Manager (DDPM)</string>
		<key>DDPM_URL</key>
		<string>https://www.delldisplaymanagermac.com/</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DDPM_URL%</string>
				<key>re_pattern</key>
				<string>(%DDPM_URL%DDPM/DDPMv*.*.zip)</string>
				<key>result_output_var_name</key>
				<string>url</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>DDPM.zip</string>
            </dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>archive_path</key>
			<string>%RECIPE_CACHE_DIR%/downloads/DDPM.zip</string>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			<key>purge_destination</key>
			<true/>
		</dict>
		<key>Processor</key>
		<string>Unarchiver</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>pattern</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%/DDPM*.pkg</string>
		</dict>
		<key>Processor</key>
		<string>FileFinder</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>expected_authority_names</key>
			<array>
				<string>Developer ID Installer: Yufu Fan (S3YBM9ALKM)</string>
				<string>Developer ID Certification Authority</string>
				<string>Apple Root CA</string>
			</array>
			<key>input_path</key>
			<string>%found_filename%</string>
		</dict>
		<key>Processor</key>
		<string>CodeSignatureVerifier</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/unpack</string>
			<key>flat_pkg_path</key>
			<string>%found_filename%</string>
		</dict>
		<key>Processor</key>
		<string>FlatPkgUnpacker</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/payload</string>
			<key>pkg_payload_path</key>
			<string>%RECIPE_CACHE_DIR%/unpack/DDPM.pkg/Payload</string>
			<key>purge_destination</key>
			<true/>
		</dict>
		<key>Processor</key>
		<string>PkgPayloadUnpacker</string>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>input_plist_path</key>
			<string>%RECIPE_CACHE_DIR%/payload/Applications/DDPM/DDPM.app/Contents/Info.plist</string>
			<key>plist_version_key</key>
			<string>CFBundleShortVersionString</string>
		</dict>
		<key>Processor</key>
		<string>Versioner</string>
	</dict>
	</array>
</dict>
</plist>
