<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>
  Creates a Unreal Engine package from a existing install/ download. You need to first Use the Epic Games launcher to download Unreal Engine to a systems Shared user folder.
			
	You must define the Engine version you need packaged at the UNREALVERSION variable, EG: 5.3.2
			
	You must define the Engine location you need packaged at the UNREALPATH variable, EG: /Users/Shared/Epic Games/UE_5.3
  </string>
	<key>Identifier</key>
	<string>com.github.Woodmember-Autopkg-Recipes.pkg.Unreal_Engine.recipe</string>
  <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>UnrealEngine</string>
        <key>MAJOR_VERSION</key>
        <string>4.4</string>
        <key>MAJOR_VERSION_DESC</key>
        <string>Enter the major release version of Unreal Engine (e.g., 4.4 for UE4.4)</string>
        <key>MINOR_VERSION</key>
        <string>4.4.4</string>
        <key>MINOR_VERSION_DESC</key>
        <string>Enter the complete version number of Unreal Engine (e.g., 4.4.4)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Users</key>
                    <string>0755</string>
                    <key>Users/Shared</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>/Users/Shared/Epic Games/UE_%MAJOR_VERSION%</string>
                <key>destination_path</key>
                <string>%pkgroot%/Users/Shared/Epic Games/UE_%MAJOR_VERSION%</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>/Users/Shared/UnrealEngine</string>
                <key>destination_path</key>
                <string>%pkgroot%/Users/Shared/UnrealEngine</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%MINOR_VERSION%</string>
                    <key>version</key>
                    <string>%MINOR_VERSION%</string>
                    <key>id</key>
                    <string>com.epicgames.unrealengine%MAJOR_VERSION%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>scripts</key>
                    <dict>
                        <key>preinstall</key>
                        <string>#!/bin/bash

# Check for and remove old version if it exists
if [ -d "/Users/Shared/Epic Games" ]; then
    # Use wildcards inside quotes to handle spaces properly
    /bin/rm -rf "/Users/Shared/Epic Games/"*
    
    # Check if Unreal Editor.app exists before trying to remove it
    if [ -e "/Applications/Unreal Editor.app" ]; then
        /bin/rm -rf "/Applications/Unreal Editor.app"
    fi
fi

exit 0</string>
                        <key>postinstall</key>
                        <string>#!/bin/bash

# Get Unreal Engine version from package
URVERSION="%MAJOR_VERSION%"

# Create symlink to Applications, ensuring spaces are handled properly
/bin/ln -sf "/Users/Shared/Epic Games/UE_${URVERSION}/Engine/Binaries/Mac/UnrealEditor.app" "/Applications/Unreal Editor.app"

# Create AutomationTool directory with proper permissions
AUTOMATION_TOOL_PATH="/Users/Shared/Epic Games/UE_${URVERSION}/Engine/Programs/AutomationTool"
/bin/mkdir -p "${AUTOMATION_TOOL_PATH}"
/bin/chmod 777 "${AUTOMATION_TOOL_PATH}"

exit 0</string>
                    </dict>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Users/Shared</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                            <key>mode</key>
                            <string>0755</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
