<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Anaglyph audio plugins (VST3 and Audio Unit) for macOS.</string>
    <key>Identifier</key>
    <string>com.github.Woodmember-Autopkg-Recipes.download.Anaglyph</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Anaglyph</string>
        <key>DOWNLOAD_PAGE_URL</key>
        <string>https://anaglyph.dalembert.upmc.fr/</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>Process</key>
    <array>
        <!-- Download the main page to find the latest download link -->
        <dict>
            <key>Comment</key>
            <string>Download the main page to find the latest macOS download link</string>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_PAGE_URL%</string>
                <key>filename</key>
                <string>index.html</string>
                <key>curl_opts</key>
                <array>
                    <string>--insecure</string>
                    <string>--location</string>
                    <string>--max-time</string>
                    <string>30</string>
                </array>
            </dict>
        </dict>
        
        <!-- Search the downloaded HTML for the macOS download link -->
        <dict>
            <key>Comment</key>
            <string>Search downloaded HTML for macOS download URL</string>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>file://%pathname%</string>
                <key>re_pattern</key>
                <string>href="(release/anaglyph-macos-v([\d\.]+)\.zip)"</string>
                <key>result_output_var_name</key>
                <string>match_url</string>
            </dict>
        </dict>
        
        <!-- Extract just the version number for later use -->
        <dict>
            <key>Comment</key>
            <string>Extract version number from URL</string>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>file://%pathname%</string>
                <key>re_pattern</key>
                <string>href="release/anaglyph-macos-v([\d\.]+)\.zip"</string>
                <key>result_output_var_name</key>
                <string>url_version</string>
            </dict>
        </dict>
        
        <!-- Download the actual plugin file using URLDownloader with insecure option -->
        <dict>
            <key>Comment</key>
            <string>Download the plugin zip file</string>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_PAGE_URL%%match_url%</string>
                <key>filename</key>
                <string>%NAME%-%url_version%.zip</string>
                <key>curl_opts</key>
                <array>
                    <string>--insecure</string>
                    <string>--location</string>
                    <string>--max-time</string>
                    <string>600</string>
                    <string>--http1.1</string>
                    <string>--retry</string>
                    <string>5</string>
                    <string>--retry-delay</string>
                    <string>10</string>
                    <string>--retry-max-time</string>
                    <string>0</string>
                    <string>--compressed</string>
                    <string>--connect-timeout</string>
                    <string>60</string>
                </array>
            </dict>
        </dict>
        
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unarchived</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        
        <dict>
            <key>Comment</key>
            <string>Find the extracted directory name</string>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unarchived/anaglyph-macos-v*</string>
            </dict>
        </dict>
        
        <dict>
            <key>Comment</key>
            <string>Extract detailed version info from VST3 plugin</string>
            <key>Processor</key>
            <string>PlistReader</string>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%found_filename%/Anaglyph.vst3/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleVersion</key>
                    <string>version</string>
                    <key>CFBundleShortVersionString</key>
                    <string>short_version</string>
                    <key>CFBundleIdentifier</key>
                    <string>bundleid</string>
                </dict>
            </dict>
        </dict>
        
        <dict>
            <key>Comment</key>
            <string>Verify VST3 plugin code signature</string>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%found_filename%/Anaglyph.vst3</string>
                <key>requirement</key>
                <string>identifier "com.cnrs.anaglyphvst" and anchor apple generic and certificate leaf[subject.CN] = "Apple Development: davipoir@gmail.com (92Y63S3QX2)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
                <key>strict_verification</key>
                <false/>
            </dict>
        </dict>
        
        <dict>
            <key>Comment</key>
            <string>Verify Audio Unit component code signature</string>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%found_filename%/Anaglyph.component</string>
                <key>requirement</key>
                <string>identifier "com.cnrs.anaglyphvst" and anchor apple generic and certificate leaf[subject.CN] = "Apple Development: davipoir@gmail.com (92Y63S3QX2)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
                <key>strict_verification</key>
                <false/>
            </dict>
        </dict>
        
        <!-- Copy plugins to staging for later packaging -->
        <dict>
            <key>Comment</key>
            <string>Copy VST3 plugin to staging</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%found_filename%/Anaglyph.vst3</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/Anaglyph.vst3</string>
            </dict>
        </dict>
        
        <dict>
            <key>Comment</key>
            <string>Copy Audio Unit to staging</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%found_filename%/Anaglyph.component</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/Anaglyph.component</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
