<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>com.github.Woodmember-Autopkg-Recipes.pkg.SplashtopStreamerJamfSS.recipe</string>
		<key>Comment</key>
		<string>Autopkg recipe for Splashtop Streamer, packaged for Jamf self-service  and auto-install distributions. 
		Includes nested package installed via post install script with sudo privileges to avoid user 
		prompts for installation location.</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Splashtop Streamer</string>
        </dict>
	    <key>MinimumVersion</key>
	       <string>1.0</string>
	       <key>ParentRecipe</key>
	   	<string>com.github.peetinc.download.SplashtopStreamer</string>
	       <key>Process</key>
	       <array>
	           <dict>
	               <key>Arguments</key>
	               <dict>
	                   <key>destination_path</key>
	                   <string>%RECIPE_CACHE_DIR%/unpack</string>
	                   <key>flat_pkg_path</key>
	                   <string>%pathname%/.Splashtop Streamer.pkg</string>
	               </dict>
	               <key>Processor</key>
	               <string>FlatPkgUnpacker</string>
	           </dict>
	           <dict>
	               <key>Arguments</key>
	               <dict>
	                   <key>destination_path</key>
	                   <string>%RECIPE_CACHE_DIR%/payload</string>
	                   <key>pkg_payload_path</key>
	                   <string>%RECIPE_CACHE_DIR%/unpack/Splashtop_Streamer-installer.pkg/Payload</string>
	               </dict>
	               <key>Processor</key>
	               <string>PkgPayloadUnpacker</string>
	           </dict>
	           <dict>
	               <key>Arguments</key>
	               <dict>
	                   <key>input_plist_path</key>
	                   <string>%RECIPE_CACHE_DIR%/payload/Splashtop Streamer.app/Contents/Info.plist</string>
	                   <key>plist_version_key</key>
	                   <string>CFBundleVersion</string>
	               </dict>
	               <key>Processor</key>
	               <string>Versioner</string>
	           </dict>
   		 <dict>
   			 <key>Processor</key>
   			 <string>PkgRootCreator</string>
   			 <key>Arguments</key>
   			 <dict>
				 <key>pkgroot</key>
				 <string>%RECIPE_CACHE_DIR%/%NAME%root</string>
                 <key>pkgdirs</key>
                 <dict>
                     <key>pkgroot</key>
                     <string>0775</string>
                 </dict>
   			 </dict>
   		 </dict>
   		 <dict>
   			 <key>Processor</key>
   			 <string>PkgRootCreator</string>
   			 <key>Arguments</key>
   			 <dict>
				 <key>pkgroot</key>
				 <string>%RECIPE_CACHE_DIR%/%NAME%scripts</string>
                 <key>pkgdirs</key>
                 <dict>
                     <key>Scripts</key>
                     <string>0775</string>
                 </dict>
   			 </dict>
   		 </dict>
         <dict>
             <key>Arguments</key>
             <dict>
                 <key>source_pkg</key>
                 <string>%pathname%/.Splashtop Streamer.pkg</string>
                 <key>pkg_path</key>
                 <string>%RECIPE_CACHE_DIR%/%NAME%scripts/Scripts/SplashtopStreamer-%version%.pkg</string>
             </dict>
             <key>Processor</key>
             <string>PkgCopier</string>
         </dict>
   		<dict>
   			 <key>Processor</key>
   			 <string>FileCreator</string>
   			 <key>Arguments</key>
   			 <dict>
				 <key>file_content</key>
				 <string>#!/bin/bash
DIR=$(dirname "$0")
APPPATH="/var/tmp"
/bin/rm -rf "$APPPATH"/SplashtopStreamer-%version%.pkg
cp -a /"$DIR"/. /"$APPPATH"/
sudo /usr/sbin/installer -verbose -pkg "$APPPATH"/SplashtopStreamer-%version%.pkg -target /
exit 0</string>
	 		<key>file_mode</key>
	 		<string>0755</string>
	 		<key>file_path</key>
	 		<string>%RECIPE_CACHE_DIR%/%NAME%scripts/Scripts/postinstall</string>
   			</dict>
   		 </dict>
 		<dict>
 			<key>Processor</key>
 			<string>PkgCreator</string>
 			<key>Arguments</key>
 			<dict>
 				<key>pkg_request</key>
 				<dict>
 					<key>pkgname</key>
 					<string>%NAME% %version%</string>
 					<key>id</key>
 					<string>com.Splashtop.%NAME%.pkg.%version%</string>
 					<key>pkgtype</key>
 					<string>flat</string>
 					<key>pkgroot</key>
 					<string>%RECIPE_CACHE_DIR%/%NAME%root/pkgroot</string>
 					<key>version</key>
 					<string>%version%</string>
 					<key>scripts</key>
 					<string>%NAME%scripts/Scripts</string>
 				</dict>
 			</dict>
 		</dict>
		<dict>
   	     <key>Processor</key>
   	     <string>PathDeleter</string>
   	     <key>Arguments</key>
   	     <dict>
   	         <key>path_list</key>
   	         <array>
				 <string>%RECIPE_CACHE_DIR%/payload</string>
				 <string>%RECIPE_CACHE_DIR%/unpack</string>
				 <string>%RECIPE_CACHE_DIR%/Applications</string>
				 <string>%RECIPE_CACHE_DIR%/Splashtop Streamerscripts</string>
				 <string>%RECIPE_CACHE_DIR%/Splashtop Streamerroot</string>
   	         </array>
   	     </dict>
   	 	</dict>
        </array>
    </dict>
</plist>
