<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Identifier</key>
		<string>com.github.Woodmember-Autopkg-Recipes.download.Matlab</string>
		<key>Description</key>
		<string>
Unpacks and preps a local Matlab install directory.
This recipe version uses the offline media created with the "MathWorks Installer" 
described in the guide here:  https://www.mathworks.com/matlabcentral/answers/259632-how-can-i-get-matlab-installation-files-for-use-on-an-offline-machine

For information on how this recipe works, please see the README in my repo (https://github.com/autopkg/MLBZ521-recipes/blob/master/ReadMe.md).
</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Matlab</string>
			<key>MATLAB_DIR_LOC</key>
			<string>Path/To/Your/Matlab/DMG</string>
			<key>MAJOR_VERSION</key>
			<string>R2024b</string>
			<key>ARCHITECTURE</key>
			<!-- Must Input either AppleSilicon or IntelProcessor -->
			<string>AppleSilicon</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>%MATLAB_DIR_LOC%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/</string>
					<key>overwrite</key>
					<true/>
				</dict>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
