<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
   <dict>
      <key>Description</key>
      <string>Downloads the latest version of Microsoft's Intune Company Portal installer package and extracts the version information from the installer package.
		   
This recipe will package Company Portal without a version naumber in the name. This is designed to work with Jamf for prestage enrollment packages. It is advised then that you have replace_package set to True in your Jamf upload policy. This means that your prestage enrollment package will be 
    updated every time Jamf release a new version. Do not use for patching purposes.</string>
      <key>Identifier</key>
      <string>com.github.Woodmember.pkg.MicrosoftIntuneCompanyPortal_StaticName</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Microsoft Intune Company Portal</string>
         <key>VENDOR</key>
         <string>Microsoft</string>
         <key>SOFTWARETITLE1</key>
         <string>Intune</string>
         <key>SOFTWARETITLE2</key>
         <string>Company</string>
         <key>SOFTWARETITLE3</key>
         <string>Portal</string>
         <key>VERSIONTYPE</key>
         <string>CFBundleShortVersionString</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>com.github.rtrouton.download.MicrosoftIntuneCompanyPortal</string>
      <key>Process</key>
      <array>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
               <key>flat_pkg_path</key>
               <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
               <key>pkg_payload_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/unpack/CompanyPortal-Component.pkg/Payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>input_plist_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/payload/Applications/Company Portal.app/Contents/Info.plist</string>
               <key>plist_version_key</key>
               <string>%VERSIONTYPE%</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
         </dict>
         <!-- After Versioner processor -->
         <dict>
            <key>Processor</key>
            <string>VersionComparer</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
               <key>predicate</key>
               <string>version_changed == FALSE</string>
            </dict>
         </dict>
         <!-- Continue with PkgCopier only if version_changed is TRUE -->
         <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
               <key>source_pkg</key>
               <string>%pathname%</string>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE1%_%SOFTWARETITLE2%_%SOFTWARETITLE3%_StaticName.pkg</string>
            </dict>
         </dict>
         <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/downloads/unpack</string>
                  <string>%RECIPE_CACHE_DIR%/downloads/payload</string>
               </array>
            </dict>
         </dict>
      </array>
   </dict>
</plist>
