<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and Packages the defined version of macOS, using the macadmins SOFA project feed. 
		The version must be entered in as regular expression. For example: 
		14.4.1 would be "14\.4\.1"
		13.5 would be "13\.5"</string>
	<key>Identifier</key>
	<string>com.github.Woodmember-Autopkg-Recipes.pkg.DefinedVersionmacOSUMAInstallerPKG</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>macOS Installer</string>
		<key>SOFA_URL</key>
		<string>https://sofa.macadmins.io/v1/macos_data_feed.json</string>
		<key>MACOS_VER</key>
		<!-- 
		This represents that specific macOS version you wish to download. This version must
		be listed in the SOFA JSON feed. 
		The version number must be written in regular expression. 
		For example: 14.4.1 would be "14\.4\.1"
		13.5 would be "13\.5"
		-->
		<string>14\.4\.1</string>		
		<key>URL_PATTERN</key>
		<string>"version":\s*"%MACOS_VER%",\s*"build":\s*".*?",\s*"apple_slug":\s*".*?",\s*"url":\s*"(https?://[^"]+)"</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.Woodmember-Autopkg-Recipes.download.DefinedVersionAppleOSInstallerPKG</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%RECIPE_CACHE_DIR%/downloads/InstallAssistant.pkg</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%displayname% %buildversion%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/downloads</string>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
