<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and Packages the insteller for the most recent major version of macOS, using the macadmins SOFA project feed.</string>
	<key>Identifier</key>
	<string>com.github.Woodmember-Autopkg-Recipes.pkg.LatestmacOSUMAInstallerPKG</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>macOS Installer</string>
		<key>SOFA_URL</key>
		<string>https://sofa.macadmins.io/v1/macos_data_feed.json</string>
		<key>APPLE_URL</key>
		<string>https://swcdn.apple.com/content/downloads/</string>
		<key>URL_PATTERN</key>
		<string>"LatestUMA"\s*:\s*{\s*"title"\s*:\s*"([^"]+)"\s*,\s*"version"\s*:\s*"([^"]+)"\s*,\s*"build"\s*:\s*"([^"]+)"\s*,\s*"apple_slug"\s*:\s*"([^"]+)"\s*,\s*"url"\s*:\s*"([^"]+)"\s*</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.Woodmember-Autopkg-Recipes.download.LatestmacOSUMAInstallerPKG</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%RECIPE_CACHE_DIR%/downloads/InstallAssistant.pkg</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%displayname% %buildversion%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/downloads</string>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
