<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of OpenMTP. Since there are separate versions for
Apple Silicon and Intel, you specify which one to download using the ARCH input variable.
Currently supported values are:
arm64 - macOS Apple Silicon
x64 - macOS Intel 64 Bit
</string>
	<key>Identifier</key>
	<string>com.github.Woodmember.download.OpenMTP</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>arm64</string>
		<key>NAME</key>
		<string>OpenMTP</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0</string>
	<key>Process</key>
	<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>github_repo</key>
					<string>ganeshrvel/openmtp</string>
					<key>asset_regex</key>
					<string>.*%ARCH%.*\.dmg$</string>
				</dict>
				<key>Processor</key>
				<string>GitHubReleasesInfoProvider</string>
			</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/OpenMTP.app</string>
				<key>requirement</key>
				<string>identifier "io.ganeshrvel.openmtp" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6UR4H85SA2"</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/OpenMTP.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
