<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string></string>
	<key>Description</key>
	<string>Downloads the latest version of RODE Central and creates a package.</string>
	<key>Identifier</key>
	<string>local.pkg.RODECentral</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RODE Central</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>local.download.RODECentral</string>
	<key>Process</key>
	<array>
    	<dict>
    		<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications/RODE Central.app</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%/Applications/RODE Central.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%/Library/</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
					<key>Processor</key>
					<string>PkgCreator</string>
					<key>Arguments</key>
					<dict>
						<key>pkg_request</key>
						<dict>
							<key>pkgname</key>
							<string>%NAME%-%version%</string>
							<key>chown</key>
							<array>
								<dict>
									<key>path</key>
									<string>Applications</string>
									<key>user</key>
									<string>root</string>
									<key>group</key>
									<string>admin</string>
								</dict>
							</array>
							<key>id</key>
							<string>%bundleid%</string>
							<key>options</key>
							<string>purge_ds_store</string>
							<key>pkgdir</key>
							<string>%RECIPE_CACHE_DIR%</string>
							<key>pkgroot</key>
							<string>%pkgroot%</string>
						</dict>
					</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/downloads</string>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>