<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Packages a Endnote DMG. Intended use is with Endnote provided licensed DMG. Ensure the PKG_PATH points to the DMG, not the directry the DMG is in</string>
	<key>Identifier</key>
	<string>com.github.Woodmember-Autopkg-Recipes.pkg.EndNote20</string>
	<key>Input</key>
	<dict>
		<key>PKG_PATH</key>
		<string>PATH/TO/Installer/DMG</string>
		<key>NAME</key>
		<string>EndNote 20</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>input_plist_path</key>
			<string>%PKG_PATH%/Install EndNote 20.app/Contents/Info.plist</string>
			<key>plist_version_key</key>
			<string>CFBundleShortVersionString</string>
		</dict>
		<key>Processor</key>
		<string>Versioner</string>
	</dict>
	<dict>
		<key>Processor</key>
		<string>CodeSignatureVerifier</string>
		<key>Arguments</key>
		<dict>
			<key>input_path</key>
			<string>%PKG_PATH%/Install EndNote 20.app</string>
			<key>requirement</key>
			<string>anchor apple generic and identifier "com.ThomsonResearchSoft.EndNote.Installer" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2Y4P62NL52")</string>
		</dict>
	</dict>
	<dict>
				<key>Arguments</key>
				<dict>
					<key>source_path</key>
					<string>%PKG_PATH%/Install EndNote 20.app/Contents/Resources/EndNote.zip</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/EndNote.zip</string>
					<key>purge_destination</key>
					<true/>
				</dict>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%RECIPE_CACHE_DIR%/EndNote.zip</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unarchive</string>
					<key>purge_destination</key>
					<true/>
				</dict>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/unarchive/EndNote/EndNote 20.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkgdirs</key>
					<dict>
						<key>Applications</key>
						<string>0775</string>
					</dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				</dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/EndNote 20</string>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/unarchive/EndNote</string>
				</dict>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>chown</key>
						<array>
							<dict>
								<key>group</key>
								<string>admin</string>
								<key>path</key>
								<string>Applications</string>
								<key>user</key>
								<string>root</string>
							</dict>
						</array>
						<key>id</key>
						<string>com.endnote.EndNote20.pkg</string>
						<key>pkgname</key>
					
						<string>EndNote-%version%</string>
						<key>pkgroot</key>
						<string>%RECIPE_CACHE_DIR%/pkgroot</string>
						<key>pkgtype</key>
						<string>flat</string>
						<key>version</key>
						<string>%version%</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>PkgCreator</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/EndNote.zip</string>
						<string>%RECIPE_CACHE_DIR%/unarchive</string>
						<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
	</plist>
