<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current standalone Microsoft OneDrive installer, extracts version information and renames the installer package. This creates a pkg compatible wiith Jamf Patch Management</string>
        <key>Identifier</key>
        <string>com.github.Woodmember-Autopkg-Recipes.pkg.microsoftonedrive.jamfpatch</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Microsoft OneDrive</string>
            <key>VENDOR</key>
            <string>Microsoft</string>
            <key>SOFTWARETITLE</key>
            <string>OneDrive</string>
            <key>VERSIONTYPE</key>
            <string>CFBundleShortVersionString</string>
        </dict>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.download.microsoftonedrive</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>flat_pkg_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpack/%SOFTWARETITLE%.pkg/Payload</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/payload</string>
                </dict>
            </dict>
			<dict>
				<key>Processor</key>
				<string>PlistReader</string>
				<key>Arguments</key>
				<dict>
					<key>info_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/%SOFTWARETITLE%.app</string>
					<key>plist_keys</key>
					<dict>
						<key>CFBundleShortVersionString</key>
						<string>bundle_short_version</string>
						<key>CFBundleVersion</key>
						<string>bundle_version</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MicrosoftOneDriveVersioner</string>
				<key>Arguments</key>
				<dict>
					<key>bundle_short_version</key>
					<string>%bundle_short_version%</string>
					<key>bundle_version</key>
					<string>%bundle_version%</string>
				</dict>
			</dict>
            <dict>
                <key>Processor</key>
                <string>PkgCopier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_pkg</key>
                    <string>%pathname%</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE%_%version%.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/unpack</string>
                        <string>%RECIPE_CACHE_DIR%/payload</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
        </array>
    </dict>
</plist>
