<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and Packagesthe latest version of Blackmagic Desktop Video using dataJAR download recipe and repackages with proper naming for deployment.</string>
	<key>Identifier</key>
	<string>com.github.Woodmember-Autopkg-Recipes.pkg.BlackmagicDesktopVideo</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Blackmagic Desktop Video</string>
		<key>PRODUCT_NAME_PATTERN</key>
		<string>^Desktop Video (?P&lt;version&gt;\d+\.\d+(\.\d+)?)$</string>
		<key>REG_CITY</key>
		<string></string>
		<key>REG_COUNTRY</key>
		<string></string>
		<key>REG_EMAIL</key>
		<string></string>
		<key>REG_FIRSTNAME</key>
		<string></string>
		<key>REG_LASTNAME</key>
		<string></string>
		<key>REG_PHONE</key>
		<string></string>
		<key>REG_STATE</key>
		<string></string>
		<key>REG_STREET</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.download.Blackmagic Desktop Video</string>
	<key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unarchived</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>

        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unarchived/Blackmagic_Desktop_Video_*.dmg</string>
            </dict>
        </dict>
		
        <dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%found_filename%</string>
                <key>items_to_copy</key>
                <array>
                    <dict>
                        <key>source_item</key>
                        <string>Install Desktop Video %version%.pkg</string>
                        <key>destination_path</key>
                        <string>%RECIPE_CACHE_DIR%</string>
                        <key>destination_item</key>
                        <string>%NAME%-%version%.pkg</string>
                    </dict>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
