<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of DaVinci Resolve Studio 18 by default. You can modify this to download any available
			legacy version as well. You can also configure this to download Studio and Lite.
		
			This recipe requires the use of the fantastic BlackMagicURLProvider processor, created by venerable timsutton. 
			You will need to add this processor to your autopkg instance. The Processor can be found on his Github:
			https://github.com/autopkg/timsutton-recipes/tree/master/Blackmagic . You will need to add his repo in order for
	    		this recipe to function.

			This product requires registration in order to download, so
			you _must_ override all input variables beginning with 'REG_'
			and they must contain data.

			Notably, REG_COUNTRY must contain sane values:
			- REG_COUNTRY is of the form 'us', 'ca', 'au', etc.
	</string>
    <key>Identifier</key>
    <string>com.github.Woodmember-Autopkg-Recipes.download.davinciresolve</string>
    <key>Input</key>
    <dict>
        <!-- You will need to update the protuct version with to DaVinci Resolve, DaVinci 
		Resolve Lite or DaVinci Resolve Studio -->
        <key>PRODUCT_VERSION</key>
        <string>DaVinci Resolve Studio</string>
        <!-- Version 14 updates _may_ contain 'Update' in the title, but
        we also want to avoid capturing the 'Studio Update' versions -->
        <key>PRODUCT_NAME_PATTERN</key>
        <string>^DaVinci Resolve Studio (?P&lt;version&gt;18(\.\d+)*)( Update)*$</string>
        <!-- This also needs to contain either DaVinci Resolve, DaVinci Resolve Lite or 
		DaVinci Resolve Studio. in between the () you will find a number representing the version
		you wish to package. Enter here 14, 15, 16, 17 or 18 -->
        <key>NAME</key>
        <string>DaVinciResolveStudio18</string>
        <!-- Needs to read DaVinciResolvePRODUCTVERSION, eg: 
		DaVinciResolveLite17 or DaVinciResolve18 or DaVinciResolveStudio18 -->
        <key>REG_FIRSTNAME</key>
        <string></string>
        <key>REG_LASTNAME</key>
        <string></string>
        <key>REG_EMAIL</key>
        <string></string>
        <key>REG_PHONE</key>
        <string></string>
        <key>REG_CITY</key>
        <string></string>
        <key>REG_COUNTRY</key>
        <string></string>
        <!-- You MUST fill in all the above reg fields. You do not need to already have a account
	It is advisable tgough to fill in details linked to your organisation. Having a org email 
	and phone number is specifically advised.-->
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg.timsutton-recipes.Blackmagic/BlackMagicURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>product_name_pattern</key>
                <string>%PRODUCT_NAME_PATTERN%</string>
                <key>product_name</key>
                <string>%PRODUCT_VERSION%</string>
                <key>registration_info</key>
                <dict>
                    <key>firstname</key>
                    <string>%REG_FIRSTNAME%</string>
                    <key>lastname</key>
                    <string>%REG_LASTNAME%</string>
                    <key>email</key>
                    <string>%REG_EMAIL%</string>
                    <key>phone</key>
                    <string>%REG_PHONE%</string>
                    <key>city</key>
                    <string>%REG_CITY%</string>
                    <key>country</key>
                    <string>%REG_COUNTRY%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
