<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of DaVinci Resolve 18 by default. You can modify this to download any available
			legacy version as well. You can also configure this to download Studio and Lite.
		
			This recipe requires the use of the fantastic BlackMagicURLProvider processor, created by the venerable timsutton. 
			You will need to add his repo to your autopkg instance. The Processor can be found on his Github:
			https://github.com/autopkg/timsutton-recipes/tree/master/Blackmagic . Info on using non standard 
			processors can be found here: https://github.com/autopkg/autopkg/wiki/Processor-Locations

			This product requires registration in order to download, so
			you _must_ override all input variables beginning with 'REG_'
			and they must contain data.

			Notably, REG_COUNTRY must contain sane values:
			- REG_COUNTRY is of the form 'us', 'ca', 'au', etc.
	</string>
	<key>Identifier</key>
	<string>com.github.Woodmember-Autopkg-Recipes.pkg.DaVinciResolve</string>
	<key>Input</key>
	<dict>
		<key>PKGNAME</key>
		<string>DaVinci Resolve Studio</string>
        <!-- You will need to update the PKGNAME with the product you are packaging.
		EG: DaVinci Resolve, DaVinci Resolve Lite or DaVinci Resolve Studio. NO NOT
		enter version number here. -->
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.Woodmember-Autopkg-Recipes.download.davinciresolve</string>
	<key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unzip/</string>
			</dict>
	     </dict>
         <dict>
             <key>Processor</key>
             <string>FileFinder</string>
             <key>Arguments</key>
             <dict>
                 <key>pattern</key>
                 <string>%RECIPE_CACHE_DIR%/unzip/*.dmg</string>
             </dict>
         </dict>
         <dict>
             <key>Processor</key>
             <string>FlatPkgUnpacker</string>
             <key>Arguments</key>
             <dict>
                 <key>flat_pkg_path</key>
                 <string>%found_filename%/*.pkg</string>
                 <key>destination_path</key>
                 <string>%RECIPE_CACHE_DIR%/distpkg</string>
             </dict>
		 </dict>
 		<dict>
 			<key>Processor</key>
 			<string>PkgPayloadUnpacker</string>
 			<key>Arguments</key>
 			<dict>
 				<key>destination_path</key>
 				<string>%RECIPE_CACHE_DIR%/payload/</string>
 				<key>pkg_payload_path</key>
 				<string>%RECIPE_CACHE_DIR%/distpkg/Manifest.pkg/payload</string>
 			</dict>
 		</dict>
		 <dict>
			 <key>Processor</key>
			 <string>FlatPkgPacker</string>
			 <key>Arguments</key>
			 <dict>
				 <key>source_flatpkg_dir</key>
				 <string>%RECIPE_CACHE_DIR%/distpkg</string>
				 <key>destination_pkg</key>
				 <string>%RECIPE_CACHE_DIR%/%PKGNAME% %version%.pkg</string>
			 </dict>
		 </dict>
		 <dict>
             <key>Processor</key>
             <string>CodeSignatureVerifier</string>
             <key>Arguments</key>
             <dict>
                 <key>input_path</key>
                 <string>%RECIPE_CACHE_DIR%/payload/Applications/DaVinci Resolve/DaVinci Resolve.app</string>
                 <key>requirement</key>
                 <string>identifier "com.blackmagic-design.DaVinciResolve" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "9ZGFBWLSYP"</string>
             </dict>
		 </dict>
			 <dict>
			     <key>Processor</key>
			     <string>PathDeleter</string>
			     <key>Arguments</key>
			     <dict>
			         <key>path_list</key>
			         <array>
			             <string>%RECIPE_CACHE_DIR%/distpkg/</string>
			         </array>
			     </dict>
			 </dict>
			 <dict>
			     <key>Processor</key>
			     <string>PathDeleter</string>
			     <key>Arguments</key>
			     <dict>
			         <key>path_list</key>
			         <array>
			             <string>%RECIPE_CACHE_DIR%/payload/</string>
			         </array>
			     </dict>
			 </dict>
			 <dict>
			     <key>Processor</key>
			     <string>PathDeleter</string>
			     <key>Arguments</key>
			     <dict>
			         <key>path_list</key>
			         <array>
			             <string>%RECIPE_CACHE_DIR%/unzip/</string>
			         </array>
			     </dict>
			 </dict>
    </array>
</dict>
</plist>
