<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
  <string>
Downloads the most recent version of Ableton Live and creates an installer package
for use when licenses are managed using Sassafras AllSight/LabSight/KeySight (KeyServer). This is based on the pkg
recipe by jazzace.

The major version and edition is specified through input variables (see the parent download recipe).
In order to avoid pkgbuild errors, the SoundCloud extension is removed from the app bundle and
the version number (from CFBundleShortVersionString) is simplified to eliminate parenthetical 
build info (the homebysix-recipes repo is required).

An Options.txt file is added (via postinstall script) in /Library/Preferences/Ableton/Live %version%/ as per 
https://help.ableton.com/hc/en-us/articles/360020530999-Authorizing-Live-for-all-users-on-macOS-with-Sassafras.
The postinstall script also copies a provided Library.cfg file to the relivant directory. Library.cfg contain setting around
the location of Ableton Live Packs. If using Ableton in a teching or Lab environment, it is advisable to have these packs
install into the Shared usre folder. set the LIBRARYCFGPATH variable to the location of your template Library.cfg

Based on this, this recipe is designed for teaching/ lab environments. The package it creates then is named to reflect this.
It is advisable in mixed environments to have this recipe and the original jazzace pkg recipe running in alongdide one another.
</string>
	<key>Identifier</key>
	<string>com.github.Woodmember.pkg.AbletonLiveSassafrasLab</string>
	<key>Input</key>
	<dict>
		<key>LIBRARYCFGPATH</key>
		<string>YOUR/Library.cfg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.AbletonLive</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
			<key>Comment</key>
			<string>Strips the build information in parenthesis from version</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/scripts</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/scripts/Library.cfg</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%LIBRARYCFGPATH%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileCreator</string>
			<key>Arguments</key>
			<dict>
				<key>file_path</key>
				<string>%RECIPE_CACHE_DIR%/scripts/postinstall</string>
				<key>file_content</key>
				<string>#!/bin/sh
# Creates an Options.txt file in the required version-specific location.
mkdir -p "/Library/Preferences/Ableton/Live %version%"
echo '-LicenseServer' > "/Library/Preferences/Ableton/Live %version%/Options.txt"
echo '-_DisableAutoUpdates' >> "/Library/Preferences/Ableton/Live %version%/Options.txt"
echo '-_DisableUsageData' >> "/Library/Preferences/Ableton/Live %version%/Options.txt"
echo '-EventRecorder=Off' >> "/Library/Preferences/Ableton/Live %version%/Options.txt"
echo '-DontAskForAdminRights' >> "/Library/Preferences/Ableton/Live %version%/Options.txt"

# Copy Library.cfg
cfg_dir=$(dirname "$0")

cp -a "$cfg_dir/Library.cfg" /Library/Preferences/Ableton/Live\ %version%/
</string>
				<key>file_mode</key>
				<string>0755</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/%app_name%</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/%app_name%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/%app_name%/Contents/App-Resources/Extensions/SoundCloud</string>
				</array>
				<key>path_list_required</key>
        		<false/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>admin</string>
						</dict>
					</array>
					<key>id</key>
					<string>%bundleid%-sassafras</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgname</key>
					<string>%NAME%-%version%-Labs</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>scripts</key>
					<string>%RECIPE_CACHE_DIR%/scripts</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<string>%RECIPE_CACHE_DIR%/scripts</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
