<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest version of ComfyUI</string>
	<key>Identifier</key>
	<string>com.github.Woodmember.pkg.ComfyUI</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ComfyUI</string>
		<key>COMFYURL</key>
		<string>https://download.comfy.org/mac/dmg/arm64</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.Woodmember.download.ComfyUI</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/%NAME%.app</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
