<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>
	Downloads Nvivo from the provided URL. You can otain Nvivo 14 and 15 URL from the following sites:
	https://techcenter.qsrinternational.com/Content/nm14/nm14_standard_installation.htm
	https://techcenter.qsrinternational.com/Content/nm15/nm15_standard_installation.htm
	</string>
	<key>Identifier</key>
	<string>com.github.Woodmember-Autopkg-Recipes.download.NVivo</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>NVivo</string>
		<key>MAJOR_VERSION</key>
		<string>15</string>
		<key>NVIVOURL</key>
		<string>https://download.qsrinternational.com/Software/NVivo%MAJOR_VERSION%forMac/NVivo.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        		<key>url</key>
				<string>%NVIVOURL%</string>
        		<key>filename</key>
        		<string>%NAME%.dmg</string>
        	</dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
