<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Downloads the latest version of Insta360 Studio 2023 and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.Woodmember-Autopkg-Recipes.pkg.Insta360 Studio 2023</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Insta360Studio2023</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.Woodmember-Autopkg-Recipes.download.Insta360 Studio 2023</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Insta360*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>	
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%found_filename%</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<string>%RECIPE_CACHE_DIR%/downloads</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
