<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest version of ChemDraw</string>
	<key>Identifier</key>
	<string>com.github.Woodmember-Autopkg-Recipes.pkg.ChemDraw</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ChemDraw</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.vmiller.download.ChemDraw</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%pathname%/ChemDraw*.app</string>
				<key>bundleid</key>
				<string>com.revvity.ChemDraw</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>version</key>
				<string>%version%</string>
			</dict>
			<key>Comment</key>
			<string>Create installer package from the ChemDraw app</string>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
