<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>com.github.Woodmember-Autopkg-Recipes.pkg.Adobe CC Admin Console Packages</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Input Adobe CC Package Name Here</string>
            <key>CCPKGPATH</key>
            <!-- Working Dirctory To All Your CC .ZIP CC DOWNLOADS. -->
            <string>Path/To/The/Directory/You/Keep/Your/CC/.ZIP/Files</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>FileFinder</string>
                <key>Arguments</key>
                <dict>
                    <key>pattern</key>
                    <string>%CCPKGPATH%/%NAME%*.zip</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
	            <string>Unarchiver</string>
	            <key>Arguments</key>
	            <dict>
	                <key>archive_path</key>
	                <string>%found_filename%</string>
	                <key>destination_path</key>
	                <string>%RECIPE_CACHE_DIR%/unzip/</string>
				</dict>
			</dict>
            <dict>
                <key>Processor</key>
                <string>PkgCopier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_pkg</key>
                    <string>%RECIPE_CACHE_DIR%/unzip/%NAME%/Build/%NAME%_Install.pkg</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/distpkg</string>
                </dict>
   		 </dict>
   		 <dict>
   			 <key>Processor</key>
   			 <string>AdobeAdminConsolePackagesInfoSniffer</string>
   			 <key>Arguments</key>
   			 <dict>
				 <key>aacp_packages_path</key>
				 <string>%RECIPE_CACHE_DIR%/unzip/</string>
   				 <key>aacp_install_pkg_path</key>
   				 <string>%RECIPE_CACHE_DIR%/unzip/%NAME%/Build/%NAME%_Install.pkg</string>
   			 </dict>
   		 </dict>
   		 <dict>
   			 <key>Processor</key>
   			 <string>FlatPkgPacker</string>
   			 <key>Arguments</key>
   			 <dict>
   				 <key>source_flatpkg_dir</key>
   				 <string>%RECIPE_CACHE_DIR%/distpkg</string>
   				 <key>destination_pkg</key>
   				 <string>%RECIPE_CACHE_DIR%/%NAME% %version%.pkg</string>
   			 </dict>
   		 </dict>
		 <dict>
		     <key>Processor</key>
		     <string>PathDeleter</string>
		     <key>Arguments</key>
		     <dict>
		         <key>path_list</key>
		         <array>
		             <string>%RECIPE_CACHE_DIR%/unzip/</string>
		         </array>
		     </dict>
		 </dict>
        </array>
    </dict>
</plist>
