<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads a CrowdStrike Falcon Sensor pkg via CrowdStrike's API.

You must provide a Client ID and Secret along with the Policy ID to determine which senor version to download.
	</string>
	<key>Identifier</key>
	<string>com.github.woodmember.download.CrowdStrikeFalcon</string>
	<key>Input</key>
	<dict>
		<key>CS_API_URL</key>
		<string>https://api.crowdstrike.com</string>
		<key>CS_CLIENT_ID</key>
		<string>09d09ufa0sdfh03abcoiy3ba98weyxas</string>
		<key>CS_CLIENT_SECRET</key>
		<string>093Uhd093HqGAH309h309fa3j0H3AsdFJ0AIH3iQ</string>
		<key>VERSION</key>
		<!-- 0  = Latest, 1 = N-1, 2 = N-2 -->
		<string>1</string>
		<key>NAME</key>
		<string>CrowdStrike Falcon</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>api_region_url</key>
				<string>%CS_API_URL%</string>
				<key>client_id</key>
				<string>%CS_CLIENT_ID%</string>
				<key>client_secret</key>
				<string>%CS_CLIENT_SECRET%</string>
				<key>version</key>
				<string>%VERSION%</string>
			</dict>
			<key>Processor</key>
			<string>FalconDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: CrowdStrike Inc. (X9E956P446)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%falcon_agent_path%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        	<dict>
            		<key>Processor</key>
           		 <string>FlatPkgUnpacker</string>
           		 <key>Arguments</key>
           		 <dict>
                	<key>flat_pkg_path</key>
			<string>%falcon_agent_path%</string>
                	<key>destination_path</key>
                	<string>%RECIPE_CACHE_DIR%/flatunpack/</string>
            	</dict>
        	</dict>
        	<dict>
           		 <key>Processor</key>
           		 <string>PkgPayloadUnpacker</string>
            		<key>Arguments</key>
            		<dict>
                	<key>pkg_payload_path</key>
			<string>%RECIPE_CACHE_DIR%/flatunpack/sensor-sysx.pkg/Payload</string>
                	<key>destination_path</key>
                	<string>%RECIPE_CACHE_DIR%/payloadunpack/</string>
            		</dict>
       		 </dict>
        <dict>
            <key>Processor</key>
            <string>FalconVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>agentinfo</key>
                <string>%RECIPE_CACHE_DIR%/payloadunpack/Applications/Falcon.app/Contents/info.plist</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
