<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Downloads the latest version of WeChat and creates a package</string>
	<key>Identifier</key>
	<string>com.github.Woodmember-Autopkg-Recipes.pkg.WeChat</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>WeChat</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.Woodmember-Autopkg-Recipes.download.WeChat</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
